# Даны два целых числа A и B (при этом A≤B). Выведите все числа
# от A до B включительно. Вводятся два целых числа


for i in range(int(input()), int(input()) + 1):
    print(i, end=' ')
