# Дан многочлен P(x) = a[n] xⁿ+a[n-1] xⁿ⁻¹+...+a[1] x+a[0] и число x
# Вычислите значение этого многочлена, воспользовавшись схемой Горнера:
# P(x)= ( ... ( ( ( a[n] x + a[n-1] ) x + a[n-2] ) x + a[n-3] ) ... ) x + a[0]
# Сначала программе подается на вход целое неотрицательное число n ≤ 20,
# затем действительное число x, затем следует n+1 вещественных
# чисел — коэффициентов многочлена от старшего к младшему.
# При решении этой задачи нельзя использовать массивы и операцию возведения
# в степень. Программа должна иметь сложность O(n), то есть при увеличении
# количества входных данных в k раз время выполнения программы должно
# вырастать примерно в k раз.

n, x = int(input()), float(input())
sum = 0

while n:
    i = n
    chlen = 1
    a = float(input())
    while i:
        chlen *= x
        i -= 1
    sum += chlen * a
    n -= 1
sum += float(input())
print(round(sum, 2))
